# Data Devidation

In [4]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv("placement - placement.csv")
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [8]:
x = df.drop(columns = ["placed"]) # input data

In [10]:
y = df["placed"] # Target data

In [12]:
from sklearn.model_selection import train_test_split

In [14]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [16]:
np.round(x_train.describe(), 2)

        cgpa  resume_score
count  80.00         80.00
mean    6.95          7.00
std     1.13          1.01
min     5.27          4.95
25%     6.00          6.28
50%     6.62          7.15
75%     8.06          7.69
max     9.31          9.06

In [18]:
x_train.describe()

            cgpa  resume_score
count  80.000000     80.000000
mean    6.949625      6.999500
std     1.125988      1.010789
min     5.270000      4.950000
25%     5.997500      6.280000
50%     6.620000      7.155000
75%     8.062500      7.692500
max     9.310000      9.060000

In [20]:
# Mean ---> Average

# Normal Distribution --> Central tendancy(mean, median) --> left and right side equal data points
# Standard Deviation --> Next value gap from central tendancy.

In [22]:
from sklearn.preprocessing import StandardScaler

In [24]:
sc = StandardScaler()

In [26]:
x_train_sc = sc.fit_transform(x_train) # fit means learn the parameters and transform means apply on that data

In [28]:
np.round(x_train_sc.describe(), 2)

AttributeError: 'numpy.ndarray' object has no attribute 'describe'

In [30]:
type(x_train_sc)

numpy.ndarray

In [42]:
x_train_new = pd.DataFrame(x_train_sc, columns = x_train.columns)
type(x_train_new)

pandas.core.frame.DataFrame

In [44]:
np.round(x_train_new.describe(), 2)

        cgpa  resume_score
count  80.00         80.00
mean   -0.00         -0.00
std     1.01          1.01
min    -1.50         -2.04
25%    -0.85         -0.72
50%    -0.29          0.15
75%     0.99          0.69
max     2.11          2.05

# Data - 2

In [50]:
df = pd.read_csv("covid_toy - covid_toy.csv")
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [52]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [54]:
from sklearn.impute import SimpleImputer # it is used for filling missing data

In [56]:
si = SimpleImputer()

In [58]:
df["fever"] = si.fit_transform(df[["fever"]])

In [60]:
df.isnull().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [62]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [64]:
df["has_covid"].value_counts()

has_covid
No     55
Yes    45
Name: count, dtype: int64

In [66]:
df["gender"] = df["gender"].map({"Male":0 , "Female":1})
df["cough"] = df["cough"].map({"Mild":0 , "Strong":1})
df["city"] = df["city"].map({"Kolkata":0 , "Bangalore":1, "Delhi":2, "Mumbai":3})
df["has_covid"] = df["has_covid"].map({"Yes":0 , "No":1})

In [68]:
df.head(3)

   age  gender  fever  cough  city  has_covid
0   60       0  103.0      0     0          1
1   27       0  100.0      0     2          0
2   42       0  101.0      0     2          1

In [70]:
x = df.drop(columns = ["has_covid"]) # input data
y = df["has_covid"] # target data

In [72]:
from sklearn.model_selection import train_test_split

In [74]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [80]:
np.round(x_train.describe(), 2 )

         age  gender   fever  cough   city
count  80.00   80.00   80.00  80.00  80.00
mean   42.91    0.59  100.98   0.40   1.26
std    24.47    0.50    1.93   0.49   1.06
min     5.00    0.00   98.00   0.00   0.00
25%    20.00    0.00  100.00   0.00   0.00
50%    42.00    1.00  101.00   0.00   1.00
75%    65.00    1.00  102.00   1.00   2.00
max    84.00    1.00  104.00   1.00   3.00

# Data = 3

In [84]:
df = pd.read_csv("tips - tips.csv")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [88]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [90]:
x = df.drop(columns = ["total_bill"])
y = df["total_bill"]

In [94]:
from sklearn.model_selection import train_test_split

In [96]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [98]:
np.round(x_train.describe(), 2 )

          tip    size
count  195.00  195.00
mean     3.09    2.57
std      1.43    0.94
min      1.00    1.00
25%      2.00    2.00
50%      3.00    2.00
75%      3.70    3.00
max     10.00    6.00

# Normalization

In [106]:
# min_value = 0, max_value = 1

In [108]:
# Play store --> app --> download 2.3M, app--> download 23k, app--> 400

In [112]:
df = pd.read_csv("placement - placement.csv")
df.head(1)

   cgpa  resume_score  placed
0  8.14          6.52       1

In [114]:
x = df.drop(columns = ["placed"])
y = df["placed"]

In [116]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [118]:
np.round(x_train.describe(), 2)

        cgpa  resume_score
count  80.00         80.00
mean    6.95          7.00
std     1.13          1.01
min     5.27          4.95
25%     6.00          6.28
50%     6.62          7.15
75%     8.06          7.69
max     9.31          9.06

In [120]:
from sklearn.preprocessing import MinMaxScaler

In [122]:
mn = MinMaxScaler()

In [124]:
x_train_mn = mn.fit_transform(x_train)

In [126]:
x_train_new = pd.DataFrame(x_train_mn, columns = x_train.columns)

In [128]:
np.round(x_train_new.describe(), 2)

        cgpa  resume_score
count  80.00         80.00
mean    0.42          0.50
std     0.28          0.25
min     0.00          0.00
25%     0.18          0.32
50%     0.33          0.54
75%     0.69          0.67
max     1.00          1.00